# 0. Magic

In [0]:
%reload_ext autoreload
%autoreload 2
%matplotlib inline

# 1. Import

In [0]:
import pandas as pd
import matplotlib.pyplot as plt

# 2. Data

เราจะสมมติข้อมูล ผู้บรรยายงานสัมมนา ขึ้นมา สังเกตว่ามีค่า Null / None ด้วย

In [49]:
df = pd.DataFrame({'Name': ["Mister A", "Mister B", "Mister C", "Mister D", "Mister E", "Mister F"], 
                   'Age': [22, 33, 30, 31, 42, 51], 
                   'Degree': ["Bachelor", "Master", "Master", "Bachelor", "Doctor", None], 
                   'Shirt': ["Red", "Blue", "Green", "Blue", None, "Blue"], 
                   })
df

       Name  Age    Degree  Shirt
0  Mister A   22  Bachelor    Red
1  Mister B   33    Master   Blue
2  Mister C   30    Master  Green
3  Mister D   31  Bachelor   Blue
4  Mister E   42    Doctor   None
5  Mister F   51      None   Blue

# 3. Preprocessing

## 3.1 One-Hot Encoding

เราจะสร้าง Dummy Column ใหม่ ขึ้้ึ้้้ึ้้นมากจาก ค่าต่าง ๆ ของ Shirt รวมถึง None/NA/Null

In [50]:
df = pd.get_dummies(df, columns=['Shirt'], dummy_na=True)
df

       Name  Age    Degree  Shirt_Blue  Shirt_Green  Shirt_Red  Shirt_nan
0  Mister A   22  Bachelor           0            0          1          0
1  Mister B   33    Master           1            0          0          0
2  Mister C   30    Master           0            1          0          0
3  Mister D   31  Bachelor           1            0          0          0
4  Mister E   42    Doctor           0            0          0          1
5  Mister F   51      None           1            0          0          0

## 3.2 Map to Int

เราจะ Map ค่าต่าง ๆ ของ Degree เป็นตัวเลขที่เรากำหนด

In [51]:
df["Degree"] = df["Degree"].map({'Bachelor': 0, 'Master': 1, "Doctor": 2})
df

       Name  Age  Degree  Shirt_Blue  Shirt_Green  Shirt_Red  Shirt_nan
0  Mister A   22     0.0           0            0          1          0
1  Mister B   33     1.0           1            0          0          0
2  Mister C   30     1.0           0            1          0          0
3  Mister D   31     0.0           1            0          0          0
4  Mister E   42     2.0           0            0          0          1
5  Mister F   51     NaN           1            0          0          0

# 4. สรุป

1. เราจะเลือกวิธี Categorize ข้อมูลอย่างไร ขึ้นกับความหมายของ Feature นั้น ๆ 
1. การมีความรู้ความเข้าใจในข้อมูล ทำให้เราเลือกวิธี Preprocessing ได้ดีขึ้น
1. โค้ดตัวอย่างใช้ Pandas DataFrame เป็นเครื่องมือจัดการข้อมูล แต่สำหรับภาษาอื่น ๆ ก็ใช้หลักการเดียวกัน